app/controllers/users_controller.rb

INSERT INTO "users" ("email", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "password_salt", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_salt" = $1, "password_hash" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_salt", "$2a$10$HGeDowNpvT5n3kSSRCbNd."], ["password_hash", "$2a$10$HGeDowNpvT5n3kSSRCbNd.SadfEi8KoxDebYuudkK2rjedk7tOlpK"], ["updated_at", "2015-03-19 23:38:08.017254"], ["id", 1]]
---
  def update
    current_user = User.find(params[:id])
    if current_user.update(user_params)